<template>
  <div class="about">
    <div class="bg"></div>
    <div class="jie-container">
      <div :class="'jie-tab-content '+$i18n.locale" v-if="clause">
        <h3 align="center">见芥网站使用条款</h3>
        <br />
        <p>感谢您访问见芥(uni verse)网站(域名)。</p>
        <br />
        <p
          style="text-indent:2em"
        >在使用本网站前请务必仔细阅读这些使用条款。在您以任何方式(自动或其他方式)访问本网站时，均表示您已经同意受本使用条款、我方隐私条款和其他条款和条件的约束。这些条款和条件在下面提及或在本网站的特定区域另有规定。您声明您可以合法地接受这些使用条款，并确保已达到订立有约束力合同的法定年龄。如果您不同意接受这些使用条款，则不得使用本网站。我们保留随时修改这些使用条款的权利。这些修改在公布后生效。如在我们公布这些修改后，您继续使用本网站，则表示您接受修改后的使用条款。</p>
        <br />
        <h3 align="center">行为准则</h3>
        <br />
        <p>在使用本网站时，您需要遵守以下几条行为准则：</p>
        <br />1、不得使用自动软件工具或手动从本网站上大量“获取”(或收集)信息。这些信息包括诸如使用本网站的其他用户的信息，以及网站上的出售品、产品、服务和促销信息。
        <br />
        <br />2、不得通过自动方式访问本网站或通过未授权渠道访问本网站或任何与本网站连接的账户或计算机系统。
        <br />
        <br />3、不得获取或者试图获取、访问本网站或我方系统中不允许您访问的区域。
        <br />
        <br />4、请勿通过大量请求“淹没”本网站，或通过其他方式使之超负荷、扰乱或者损害本网站或网站系统。
        <br />
        <br />5、不得对本网站或其系统进行反向工程或包裹。
        <br />
        <br />6、不得限制或阻止其他用户使用本网站。
        <br />
        <br />在使用本网站时，必须遵守所有适用的法律并履行合同义务。
        <br />
        <h3 align="center">网站内容和提交内容的所有权</h3>
        <br />
        <p
          style="text-indent:2em"
        >本网站上显示的内容和材料等知识产权，包括但不限于所有版权、商标权和外观设计权均归我们、我们的许可人或合伙人所有。您可将本网站(包括网站内容和材料)用于个人的、非商业目的的使用(使用或转载前请与我方工作人员联系并得到我方授权后方可使用。)，但是不得进行商业目的的使用。您不得以任何形式或媒介(包括邮件或其他电子方式)修改、拷贝、复制、再发布、上传、张贴、传输、翻译、出售、制造衍生品、利用或散布本网站上的任何材料，除非本使用条款或者材料所有者明确授权。然而，您可随时下载和/或打印网站的单独页面的副本，用于个人的、非商业目的的使用，但前提是您要原封不动地保持网页上所有版权和其他专有权通知。在您将任何材料或内容上传或张贴到本网站时，表示您已授予我们和我们的附属公司免版税的、永久的、不可撤销的、可转让的、可让渡的、可再许可的全球使用许可权。我们可以出于商业目的通过我们所选择的任何形式、媒介、以及技术(不论是现有还是将来才被开发出来的)来使用该材料或内容(包括其变体)。您声明，您在本网站张贴或以其他方式上传到本网站的任何材料和内容是您原创的，且您有权授予我们以上权利。请不要向我们发送您对我们业务的想法。因为我们也在不断思考、创作，我们可能自己本来就有类似的想法。为了避免因您向我们发送的想法在我们和您之间发生纠纷。</p>
        <br />
        <h3 align="center">网站注册</h3>
        <br />
        <p
          style="text-indent:2em"
        >您可在本网站创建一个账户或向本网站上传您的个人资料以及在本网站注册您的个人资料。您同意按照相应的注册或登录提示，提供关于您的真实、准确、最新、完整的资料，并且您必须确保这些资料是最新的(包含您的联系方式，以便我们确保能够联系您)。您提交的信息必须是关于您自己的(不能冒充其他人或实体)信息，并不得出售、共享或者转让您的账户信息。电子通讯</p>
        <br />
        <p
          style="text-indent:2em"
        >您和我们之间通过本网站进行的通讯，无论是您访问本网站还是向我们发送邮件，也无论是我们在本网站上发布公告还是与您通过邮件进行交流等，均是采用电子方式进行的。为了合同目的，您同意接收我们以电子方式向您发出的通讯，并且您也同意，我们通过电子方式提供给您的所有条款和条件、协议、通知、披露和其他通讯满足以书面形式做出的同样的通讯所能满足的所有法律要求。前述规定不影响您不可放弃的权利。对本网站所做的修改</p>
        <br />
        <p
          style="text-indent:2em"
        >我们保留修改、暂停、中止或终止本网站或网站的任何部分的权利。您同意，对于任何修改、暂停、中止或终止，我们对您或任何第三方概不承担责任。暂停或终止访问</p>
        <br />
        <p
          style="text-indent:2em"
        >我们有权以任何理由(如违反使用条款)随时拒绝、暂停或终止您访问我们的网站或网站任何功能或部分、删除或放弃您上传到本网站的任何内容或材料。此外，如用户反复侵犯知识产权，我们有依照政策，终止其使用本网站的特权。即使我们暂停或终止您访问和/或使用本网站，您仍需继续遵守暂停或终止之日仍然有效的使用条款。</p>
        <br />
        <h3 align="center">链接政策</h3>
        <p style="text-indent:2em">
          <br />本网站包含一些跳转到其他网站或产品和服务的第三方卖家的链接。提供这些链接仅为了方便您使用，在您通过这些链接跳至其他网站时，风险自负。对于其他网站上的内容或网站上出售的产品和服务，我们概不承担任何责任，也不支持这些内容。对于上述网站内容的准确性，我们也不承担责任。当您访问链接网站时，请您务必仔细阅读链接网站上公布的使用条款和隐私条款。迎您建立至本网站的链接，只要：
        </p>
        <br />
        <p>(i)本网站在新的浏览窗口打开，且网页能够完整显示(例如，不只显示一个网站框架、不只“内链”到本网站上的某个特定图片或内容)，</p>
        <br />
        <p>(ii)与本网站的链接不会显示或暗示您的网站或服务与我们或者由本网站之间有任何赞助关系；以及</p>
        <br />
        <p>(iii)本网站不以显示框形式显示，其内容不与其他内容相混淆。未经我们明确的书面许可，您不得在您的网站上使用本网站中出现的任何商标、服务标志或受版权保护的材料，包括但不限于任何图标。我们保留发出通知后取消您建立的至本网站的链接的权利。在您收到我们发出的通知后，您同意中断与本网站的链接。赔偿</p>
        <br />
        <p
          style="text-indent:2em"
        >您同意赔偿、保护以及使我们、我们的附属公司及各自的董事、高管、员工和代理人免受任何因您使用本网站、向本网站上传资料、或因您或使用您的账号访问本网站的其他人违反使用条款或适用法律而遭受的索赔、责任、损失、损害、成本和费用，包括合理的律师费。对于应由您提供补偿的事项，我们保留自费取得专属抗辩和控制的权利。在这种情况下，您同意协助我们对此类索赔进行抗辩。本赔偿、辩护和免受损害义务在本使用条款及您对本网站的使用终止后仍然有效。</p>
        <br />
        <h3 align="center">管辖权问题</h3>
        <p
          style="text-indent:2em"
        >本网站由我们通过在美国的设施来控制和运行。如果您选择从其他地方访问本网站，您有责任在当地法律的适用的范围内遵守当地法律。适用法律、不可弃权和效力瑕疵</p>
        <br />
        <p
          style="text-indent:2em"
        >本使用条款及您与我们之间的关系受美国法律和纽约州法律管辖，不影响任何冲突法原则。我们未履行或未执行任何权利或使用条款的任何规定的行为不能被视为放弃这些权利或规定。即便本使用条款中的任何规定被有司法管辖权的法院认定无效，你我双方仍然同意法院应尽力使这些规定所反映的意图继续有效，并且，本条款和条件中的其他规定仍然全部有效。适用的法律和司法管辖权</p>
        <br />
        <p
          style="text-indent:2em"
        >网站方与使用方之间如果产生任何纠纷，任何一方仅能向位于纽约南部地区的联邦地区法院中的一个有司法管辖权的法院提起诉讼。如果前述法院对此纠纷无管辖权，则须提交给一个位于纽约市曼哈顿区的纽约州法院来裁决。双方均同意上述法院享有排他的管辖权，并同意不再向任何其他法院或法庭就使用条款规定事宜或相关事宜提出任何法律诉讼。使用条款规定事宜或相关事宜引起任何法律诉讼在纽约市曼哈顿区联邦法院或州法院被提起时，各方放弃对管辖权提出异议的权利，并且各方同意不再向前述法庭申辩或者声称前述法庭不适于审理这些诉讼。</p>
        <br />
        <h3 align="center">免责条款</h3>
        <br />
        <p
          style="text-indent:2em"
        >我们在“现状”和“现有”的基础上提供本网站，不提供任何明示或暗示的担保(包括适销性、适合特定用途、无侵权等担保)。这就意味着我们不承诺：</p>
        <p>本网站在任何特定时间可用，本网站满足任何特殊要求，或提供任何特殊结果，本网站的信息准确无误，为最新的，本网站，或者传输到本网站或由本网站传出的或者存储到本网站上的信息是安全的，不会遭到未授权的访问，或者本网站不会中断、没有任何错误、不存在病毒或其他有害插件，或者这些缺陷会得到修正。</p>
        <br />
        <p
          style="text-indent:2em"
        >对于通过本网站订购或由本网站提供的任何产品或服务，我们也同样不作任何担保或声明。通过本网站订购或由本网站提供的任何产品和服务均是按照“现状”提供的，除非您与我们另行签订单独协议。您同意自行承担使用本网站的风险。虽然我们已经尽力确保本网站上公布的信息准确无误，且是最新的，但是我们仍有权随时修改或纠正任何信息(包括定价)。对于本网站上提供的任何信息，我们无法也从未保证它们的正确性、时效性、准确性、全面性或完整性；</p>
        <br />
        <p
          style="text-indent:2em"
        >对于本网站上提供的任何错误信息或遗漏，我们概不负责。您通过我们或者本网站得到的任何口头或书面的建议、结果或信息均不构成任何未在此明示的担保。我们在此对以下担保和声明免责——而您也在此对以下担保和声明放弃权利：在任何产品或服务的印刷品中的，或在常见问题文件和客服文件中的，或由客服和客服代理作出的，或者在本网站上或在与我们或我们的代理的通信中作出的保证和声明。对于用户在我们网站上发布的任何内容或材料，以及用户之间或用户和第三方之间的纠纷，我们也不承担任何责任。上述免责声明适用于我们、我们的附属公司、关联公司以及参与我们的网站创建、制作或发布的第三方及其员工和代理。</p>
        <h3 align="center">责任限制</h3>
        <br />
        <p style="text-indent:2em">如您对本网站、网站上的任何材料、产品或服务或者网站使用条款感到不满意，您唯一能够采取的行动或获得的救济就是停止使用本网站。</p>
        <p>任何情况下，我们或我们的任何附属公司或各自的董事、高管、员工、代理人、内容提供者或服务提供者，都一概不承担由使用或无法使用此网站(或由此网站部分内容、材料和功能)引发的，或直接、间接与之相关的损害赔偿(包括但不限于直接的、间接的、特殊的、附带的、从属的、惩罚性或惩戒性的损害赔偿)。</p>
        <p>无论前述损害赔偿是否源自合同之诉、疏忽或严格责任，我们都一概不予承担，即使我们已获知、应知或被告知此类损害赔偿的可能性。因为部分国家不允许排除或部分免除某些种类的损害赔偿，上述责任限制可能不适用于您。</p>
        <p>这些国家中，我们、我们附属公司及各自的董事、高管、员工、代理人、内容提供者或服务提供者的责任仅限于该国法律所允许的范围内的责任。</p>
        <br />
        <h3 align="center">其他</h3>
        <p
          style="text-indent:2em"
        >本使用条款连同在本文引述的或适用于本网站特定区域的使用条款、隐私条款和任何附加条款和条件构成我们与您就本网站达成的整体协议。本协议为您个人所有，不得转让他人。若本使用条款的任何规定被裁定为非法、无效或出于任何原因而无法执行，则该条款应被视为是可分割的，不影响其他条款的有效性和可执行性。这些使用条款非旨在使任何第三方获益，也不产生任何第三方受益人。因此，只有您或我们可引用或执行这些使用条款。</p>

        <br />
        <br />
        <p>最新更新：发表新版本时更新日期</p>
        <br />
        <br />
      </div>
    </div>
  </div>
</template>

<script>
import { mapState, mapMutations } from "vuex";

export default {
  name: "about",
  computed: mapState(["isTitle"]),
  data() {
    return {
      count: -1,
      contact: false,
      work: false,
      clause: true,
      recruitment: this.$t("about.recruitment")
    };
  },
  mounted() {},
  methods: {
    active(index) {
      if (index == this.count) {
        this.count = -1;
        return false;
      }
      this.count = index;
    }
  }
};
</script>

<style lang="less" scoped>
.about {
  height: 100%;
  min-height: 100vh;
  padding: 11rem 1rem 0 1rem;
  background-color: #00000099;
  .jie-tab-content {
    text-transform: capitalize;
    letter-spacing: 2px;
    line-height: 25px;
    font-weight: 100;
    opacity: 0.7;
    text-align: justify;
    font-size: 0.8rem;
    h3 {
      // font-weight: 100;
      margin: 3rem 0;
      opacity: 0.9;
    }
  }
  .bg {
    top: 0;
    left: 0;
    z-index: -1;
    position: fixed;
    opacity: 0.8;
    width: 100%;
    height: 100%;
    background-image: url("../assets/image/about/IMG_7906_BG.jpg");
    background-size: cover;
    background-position: center;
  }
  .jie-tab-warp {
    display: flex;
    .jie-tab-btn {
      width: 9.583333rem;
      font-size: 0.75rem;
      .jie-tab-btn-item {
        margin: 0 0 3.75rem 0;
        span {
          cursor: pointer;
          padding: 0 0 0.33333rem 0;
          border-bottom: 1px solid #ffffff00;
        }
        &.active {
          span {
            border-bottom-color: #ffffff;
          }
        }
      }
    }
    .jie-tab-content {
      padding: 0 1rem;
      color: #fefefe;
      // width: 46.333333rem;
      flex: 1;
      font-size: 0.6666666rem;
      font-weight: 400;
      line-height: 1.2083333rem;
      li {
        padding: 0.6666rem 0 0.66666rem 0;
        border-bottom: 1px solid #ffffff;
        p {
          position: relative;
          cursor: pointer;
          &::before {
            content: "";
            position: absolute;
            right: 15px;
            top: 47%;
            box-sizing: border-box;
            width: 10px;
            height: 10px;
            border-right: 2px solid #b3b3b3;
            border-bottom: 2px solid #b3b3b3;
            transition: transform 0.2s linear;
            transform: rotate3d(0, 0, 1, -45deg);
          }
        }
        &.active {
          p::before {
            content: "";
            position: absolute;
            right: 15px;
            top: 47%;
            box-sizing: border-box;
            width: 10px;
            height: 10px;
            border-right: 2px solid #b3b3b3;
            border-bottom: 2px solid #b3b3b3;
            transition: transform 0.2s linear;
            transform: rotate3d(0, 0, 1, 45deg);
          }
          .content {
            display: block;
          }
        }
        .content {
          display: none;
        }
      }
      hr {
        height: 1px;
        margin: 0;
        background-color: #ffffff;
      }
      > p {
        margin: 1rem 0 1rem 0;
      }
      span {
        display: inline-block;
        margin: 0 0 2rem 0;
      }
    }
  }
}

@media screen and (max-width: 640px) {
  .about {
    .jie-tab-content {
      padding: 0 30px;
    }
  }
}
</style>